app/controllers/home_controller.rb

SELECT COUNT(*) FROM "short_urls"
---
def index

  $short_count = ShortUrl.count