app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "iop@io.com"], ["LIMIT", 1]]
---
def check_login
email = params[:email]
pass = params[:password]
@user = User.find_by(email: email)